Beam Nº: 1                                                                2                                                                3
Step         r0           vwind        fg           cn2_quad     cn2u53_quad       r0           vwind        fg           cn2_quad     cn2u53_quad       r0           vwind        fg           cn2_quad     cn2u53_quad   
     1   0.196853E-02 0.391321E+00 0.854790E+02 0.487074E-09 0.101973E-09 0.456721E-02 0.876913E+00 0.825609E+02 0.119788E-09 0.962369E-10 0.456721E-02 0.876913E+00 0.825609E+02 0.119788E-09 0.962369E-10
     2   0.231365E-02 0.473582E+00 0.880170E+02 0.372108E-09 0.107069E-09 0.560456E-02 0.927838E+00 0.711867E+02 0.851653E-10 0.751708E-10 0.560456E-02 0.927838E+00 0.711867E+02 0.851653E-10 0.751708E-10

 -------------------------------------------
 Averaged Results for beam number:            1
   r0                : 0.212259E-02
   vwind             : 0.428241E+00
   fg                : 0.867542E+02
   length            : 0.200000E+02
   cn2_quadrature    : 0.429591E-09
   cn2u53_quadrature : 0.104521E-09
 -------------------------------------------

 -------------------------------------------
 Averaged Results for beam number:            2
   r0                : 0.501561E-02
   vwind             : 0.898308E+00
   fg                : 0.770140E+02
   length            : 0.707107E+01
   cn2_quadrature    : 0.102477E-09
   cn2u53_quadrature : 0.857039E-10
 -------------------------------------------

 -------------------------------------------
 Averaged Results for beam number:            3
   r0                : 0.501561E-02
   vwind             : 0.898308E+00
   fg                : 0.770140E+02
   length            : 0.707107E+01
   cn2_quadrature    : 0.102477E-09
   cn2u53_quadrature : 0.857039E-10
 -------------------------------------------

 -------------------------------------------
 Results from averaged quantities for beam number:            1
   r0                : 0.210451E-02
   vwind             : 0.453224E+00
   fg                : 0.926040E+02
   length            : 0.200000E+02
   cn2_quadrature    : 0.435759E-09
   cn2u53_quadrature : 0.116529E-09
 -------------------------------------------

 -------------------------------------------
 Results from averaged quantities for beam number:            2
   r0                : 0.478332E-02
   vwind             : 0.910317E+00
   fg                : 0.818336E+02
   length            : 0.707107E+01
   cn2_quadrature    : 0.110905E-09
   cn2u53_quadrature : 0.948281E-10
 -------------------------------------------

 -------------------------------------------
 Results from averaged quantities for beam number:            3
   r0                : 0.478332E-02
   vwind             : 0.910317E+00
   fg                : 0.818336E+02
   length            : 0.707107E+01
   cn2_quadrature    : 0.110905E-09
   cn2u53_quadrature : 0.948281E-10
 -------------------------------------------
